### Terraform `plan` Succeeded for Workspace: `default`
<details open><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place
-   destroy

Terraform will perform the following actions:

  # cloudflare_certificate_pack.advanced_cert_for_services will be created
+   resource "cloudflare_certificate_pack" "advanced_cert_for_services" {
+       certificate_authority  = "digicert"
+       cloudflare_branding    = false
+       hosts                  = [
+           "*.gigantic.seichi.click",
+           "*.map.gigantic.seichi.click",
+           "*.map.spring.seichi.click",
+           "*.spring.seichi.click",
+           "seichi.click",
        ]
+       id                     = (known after apply)
+       type                   = "advanced"
+       validation_method      = "txt"
+       validity_days          = 365
+       wait_for_active_status = false
+       zone_id                = "77c10fdfa7c65de4d14903ed8879ebcb"

+       validation_errors {
+           message = (known after apply)
        }

+       validation_records {
+           cname_name   = (known after apply)
+           cname_target = (known after apply)
+           emails       = (known after apply)
+           http_body    = (known after apply)
+           http_url     = (known after apply)
+           txt_name     = (known after apply)
+           txt_value    = (known after apply)
        }
    }

  # cloudflare_page_rule.resource_packs will be destroyed
  # (because cloudflare_page_rule.resource_packs is not in configuration)
-   resource "cloudflare_page_rule" "resource_packs" {
-       id       = "ecf41d25fefece0dec9935f1f1fb0350" -> null
-       priority = 2 -> null
-       status   = "active" -> null
-       target   = "s1-map-gigantic.seichi.click/resourcepacks/*" -> null
-       zone_id  = "77c10fdfa7c65de4d14903ed8879ebcb" -> null

-       actions {
-           always_use_https    = false -> null
-           browser_check       = "off" -> null
-           disable_apps        = false -> null
-           disable_performance = false -> null
-           disable_railgun     = false -> null
-           disable_security    = false -> null
-           disable_zaraz       = false -> null
-           edge_cache_ttl      = 0 -> null
-           security_level      = "high" -> null
        }
    }

  # cloudflare_page_rule.seichi_maps will be updated in-place
!   resource "cloudflare_page_rule" "seichi_maps" {
        id       = "3622ba2c1baee28921f3c6af67847982"
!       target   = "*-map-gigantic.seichi.click/*" -> "*.map.gigantic.seichi.click/*"
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # cloudflare_page_rule.seichi_ranking will be updated in-place
!   resource "cloudflare_page_rule" "seichi_ranking" {
        id       = "a232235a8d9dcdfc421345f0212d9095"
!       priority = 4 -> 3
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # cloudflare_page_rule.spring_maps will be updated in-place
!   resource "cloudflare_page_rule" "spring_maps" {
        id       = "e9b0eedea94623fa989e03e57ef63b8b"
!       priority = 3 -> 2
!       target   = "*-map-spring.seichi.click/*" -> "*.map.spring.seichi.click/*"
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 3 to change, 1 to destroy.
```
</details>